Courses/7140/Lectures/Homeworks/7140-homework-1-moreex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-13 Sun 18:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Adv Software Eng: HW Problems</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="CS7140 Adv Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Adv Software Eng: HW Problems</h1>
<p>
Home work in this course is done individually, without help from
others.  The due date is announced on the course home page.
</p>

<p>
In this HW1, we are focussed on the Design by Contract and use of
Assertions.
</p>

<p>
The numbers in parens indicate relative importance of subtopics.  Do
not expect them to add upto a 100.
</p>


<div id="outline-container-org75782e3" class="outline-2">
<h2 id="org75782e3"><span class="section-number-2">1</span> Improve OOD C++</h2>
<div class="outline-text-2" id="text-1">
<p>
[45 points] [Improve OOD] [C++] The file <a href="../Examples/Worms/worms-one-file.cpp.html">worms.cpp colorized</a> |
<a href="../Examples/Worms/worms-one-file.cpp">worms.cpp plain</a> implements a grass roots game example of wiggly worms
(scissor heads, cannibals, or vegetarian kind) moving about.
Additional Notes in the pages at <a href="../Lectures/Examples/Worms/">Worms</a>.
</p>

<ol class="org-ol">
<li>(40) Revise it so that it is in "proper" OOP form.  Describe the end
result and the changes made in a brief tech report.</li>
<li>(60) Write entry- and exit-assertions for all the methods, and class
invariants.  You may ignore assertions relating to
<code>ncurses.h</code>.</li>
<li>(20) The design and code-as-given does not "really" do anything
about the z-axis.  Suggest ideas and implement.</li>
<li>(00) It probably has bugs.  Feel free to ignore its bugs (that is,
you are not expected to fix bugs).  If you can, identify them!</li>
<li>(10) Write one or two paragraphs reporting on how you discovered and
revised the classes, and on your experince with the tools you
used to carry out this assignment.</li>
</ol>
</div>

<div id="outline-container-orga6ba2d8" class="outline-3">
<h3 id="orga6ba2d8"><span class="section-number-3">1.1</span> Bonus</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>[25 points Bonus] The worms program given above did not use
threads.  Use threads to improve the "look and feel" and revise
your answers to 1.1 through 1.5.</li>
<li>Bonus points help only when you are just below a grading curve.  At
the discretion of your instructor.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org4a6135f" class="outline-2">
<h2 id="org4a6135f"><span class="section-number-2">2</span> Implement Condense the Numerical Ranges [CNR]</h2>
<div class="outline-text-2" id="text-2">
<p>
[45 points] [In Java8+, or Kotlin] See Section 6 of
<a href="../Examples/Condense-Num-Ranges/">../Examples/Condense-Num-Ranges/</a>.  Two designs were presented to the
CNR Problem.  Implement these in Java or Kotlin.  Later, we will use
this code during discussions of Testing, etc.  The numbers within
parens indicate relative importance.  They do not add up to a 100.
</p>

<ol class="org-ol">
<li>(60) Write entry- and exit-assertions for all (well, longer than 10
lines) the methods, and all class invariants.  For every loop,
include a strong (strongest?) loop invariant.</li>

<li>(50) Correctness must be the focus.  Efficiency is important, but a
distant secondary goal.  Include supporting discussion.</li>

<li>(20) Include test results for at least 200 examples.  Explain how
you constructed these examples.  Chronologically, we are yet to
cover testing.</li>

<li>(10) Must build cleanly with the latest Java8+ or Kotlin.  Note
that Java10+ is around the corner.  Use a build system of your
choice: ant, maven or gradle.</li>

<li>(10) Write one or two paragraphs reporting on how you discovered and
revised the classes, and on your experience with the tools you used
to carry out this assignment.</li>
</ol>
</div>
</div>


<div id="outline-container-org015ceec" class="outline-2">
<h2 id="org015ceec"><span class="section-number-2">3</span> Archive</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>For awareness and archival purposes, some old HW1 problems are
(still) included below.</li>
</ol>
</div>

<div id="outline-container-org7228152" class="outline-3">
<h3 id="org7228152"><span class="section-number-3">3.1</span> Game of Life</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>[45 points] [Java8] [JavaFX] [Threads] [Testing] Read about the
Game of Life by Conway (GoL) on the wikipedia.</li>

<li>(40) Design and implement in Java an elegant looking GoL program.
Google Play has several Android APKs.  Use the source code of
<a href="http://www.bitstorm.org/gameoflife/">http://www.bitstorm.org/gameoflife/</a>. Or not.</li>

<li>(60) Write entry- and exit-assertions for all (well, longer than 10
lines) the methods, and all class invariants.  For every loop,
include a strong (strongest?) loop invariant.</li>

<li>(30) Outline a rigorous (executable?) specification that every GoL
program should satisfy.  Two candidate languages for the executable
specs are Python and Haskell.</li>

<li>(60) Many GoL programs fail to implement the game properly.
Particularly, the concurrency of life forms and the infinite grid
parts.  How do we devise a test plan to check that well-known
example patterns are done right?</li>

<li>(10) Must build cleanly with the latest Java + JavaFX or Kotlin.
You are welcome to use an alternative instead of JavaFX.  But then
include an articulation of why.</li>
</ol>
</div>
</div>

<div id="outline-container-org11ddbc5" class="outline-3">
<h3 id="org11ddbc5"><span class="section-number-3">3.2</span> Print Errors</h3>
</div>
<div id="outline-container-org92e14e3" class="outline-3">
<h3 id="org92e14e3"><span class="section-number-3">3.3</span> Freecell Solitaire</h3>
</div>
<div id="outline-container-org56e5f74" class="outline-3">
<h3 id="org56e5f74"><span class="section-number-3">3.4</span> Library Method strlen(3)</h3>
</div>
<div id="outline-container-org8251146" class="outline-3">
<h3 id="org8251146"><span class="section-number-3">3.5</span> The Famous "Telegram Problem"</h3>
<div class="outline-text-3" id="text-3-5">
<ol class="org-ol">
<li>(Originally described in 197x by Peter Naur, 2005 Turing Award
Winner.)</li>
<li>Informal Problem Statement: "Write a program that takes a number w,
then accepts lines of text and outputs lines of text, where the
output lines have as many words as possible but are never longer
than w characters. Words may not be split, but you may assume that
no single word is too long for a line."</li>
<li>The problem is analyzed at length by Bertrand Meyer.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org992c645" class="outline-2">
<h2 id="org992c645"><span class="section-number-2">4</span> Journal</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>[10 Easy-to-Earn Points] Please maintain a journal for this
homework.  Submit a summary.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdd39be0" class="outline-2">
<h2 id="orgdd39be0"><span class="section-number-2">5</span> Turn In</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Follow all ethical/ scholary traditions of attribution.</li>

<li>Include screenshots, particularly for the Worms program.  Other
than the source code files, put everything else together and
produce <b>one</b> PDF file.</li>

<li>The file hw1.tar.bzip2 should be a compressed tar ball of all the
files related to this homework.  Include the revised/ original
source code files so that everything builds cleanly.  I expect to
see sub-directories for each problem.  I expect to be able to build
all the programs by invoking <code>make</code>, &#x2026;, <code>gradlew build</code> at the
top level.</li>

<li>Submit on Pilot.</li>
</ol>
</div>
</div>

<div id="outline-container-org898574a" class="outline-2">
<h2 id="org898574a"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Prabhaker Mateti, Lecture Notes on Wiggly Worms</li>
<li>Prabhaker Mateti, Lecture Notes on Condense Num Ranges</li>
<li>Prabhaker Mateti, A Collection of HW1 Problems.</li>
</ol>
</div>
</div>

<div id="outline-container-org80e7023" class="outline-2">
<h2 id="org80e7023"><span class="section-number-2">7</span> End</h2>
<div class="outline-text-2" id="text-7">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 &bull; <a href="https://cecs.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2020-09-11
</div>
</body>
</html>
